{
  "data": [
    {
      "title": "I Forgot What “Rank” Means.",
      "subtitle": "(Or Maybe I Never Knew)",
      "date": "2025-12-14T20:31:00.000Z",
      "draft": false,
      "summary": "A reflection on the mathematical definition of matrix rank, inspired by a YouTube short.",
      "slug": "rank-definition",
      "image": "../assets/rank-definition/ig.png",
      "content": "<p>I saw a Instagram post the other day, the interviewer was asking random college students five questions related to their major. And one of the questions for a math major was: “what is the rank (of a matrix)?”</p>\n<p><img src=\"../assets/rank-definition/ig.png\" alt=\"instagram Post\">\n<a href=\"https://www.instagram.com/reel/DRpeGp9Cf2l/\">Screenshot of the IG Post where a college student is being interviewed</a></p>\n<p>The interviewee couldn’t answer on the spot, though she claimed to have known it at one point. As a former math major, I feel like I should know the answer, but I couldn’t recall the exact definition either.</p>\n<p>Browsing through the comment section, some people were attempting to answer the question while dunking on the interviewee at the same time. From what I recall, all the comments defined the rank as “number of non-zero rows of a matrix in its Reduced Row Echelon Form (RREF)”.</p>\n<p>For those who don’t know, or need a refresher on linear algebra, RREF is a special case of Row Echelon Form, which is defined (<a href=\"https://en.wikipedia.org/wiki/Row_echelon_form\">by wikipedia</a>) as:</p>\n<ul>\n<li>All rows having only zero entries are at the bottom.</li>\n<li>The leading entry (that is, the leftmost non-zero entry) of every non-zero row, called the pivot, is to the right of the leading entry of every row above.</li>\n</ul>\n<p>And RREF has two more conditions:</p>\n<ul>\n<li>The leading entry in each nonzero row is 1 (called a leading one).</li>\n<li>Each column containing a leading 1 has zeros in all its other entries.</li>\n</ul>\n<p><img src=\"../assets/rank-definition/rref.svg\" alt=\"RREF Example\"></p>\n<p>Something doesn’t sit right with me. Using Gaussian Elimination (row operations) to find RREF is just the algorithm to <em>compute</em> rank; but there must be an actual mathematical meaning to the concept itself.</p>\n<p>Turns out, rank is defined as the dimensions of the vector space spanned by a matrix’s columns. In other words, number of linearly independent columns in that matrix. And intuitively, by doing Gaussian Elimination, columns that are merely linear combinations of others are 'eliminated’. (as the name implied). This is a much more satisfying definition, as now it provides a mathematical (and in some application physical) trait of the matrix.</p>\n<p>Reflecting when I took linear algebra as a freshman, I was carried away by stress of homework and exam grades, and focused more on the problem solving aspect of the course. To be honest, besides the definition of rank, I don’t think I really understood linear space, kernel, or any functional analysis related topic at all. It wasn’t until I took Real Analysis and Convex Optimization, that those things really started to make sense.</p>\n<p>I’ve always joked that the biggest takeaway from my math degree was realizing I wasn’t cut out for a career in math. But the runner-up lesson was developing my internal BS trigger, especially when it comes to definitions.</p>\n",
      "url": "/blog/rank-definition"
    },
    {
      "title": "Building a Modern Portfolio: Angular + Node.js",
      "date": "2024-12-14T20:00:00.000Z",
      "draft": false,
      "summary": "A deep dive into the architecture of this website, featuring Angular 19, a custom Node.js content pipeline, and Docker.",
      "slug": "project-architecture",
      "image": null,
      "content": "<p>Welcome to my new portfolio site! This project represents a modern approach to static site generation, combining the component-based architecture of <strong>Angular</strong> with a lightweight <strong>Node.js</strong> content pipeline.</p>\n<h2>The Architecture</h2>\n<p>The core philosophy behind this project is <strong>simplicity and control</strong>. Instead of relying on heavy static site generators, we use a custom script to process content.</p>\n<h3>1. Angular Frontend</h3>\n<p>The user interface is built with <strong>Angular</strong>, utilizing the latest features like <strong>Signals</strong> and <strong>Standalone Components</strong>.</p>\n<ul>\n<li><strong>Navigation</strong>: Client-side routing with the Angular Router ensures instant page transitions.</li>\n<li><strong>Material Design</strong>: Angular Material provides a robust, accessible component library.</li>\n<li><strong>Data Fetching</strong>: The <code>BlogService</code> uses Angular's <code>HttpClient</code> to fetch content dynamically.</li>\n</ul>\n<h3>2. Node.js Content Pipeline</h3>\n<p>We replaced the traditional CMS with a simple <strong>Node.js script</strong>.</p>\n<ul>\n<li><strong>Content</strong>: All blog posts are written in standard <strong>Markdown</strong> in the <code>content/posts</code> directory.</li>\n<li><strong>Processing</strong>: A custom script (<code>scripts/generate-content.js</code>) parses these files using:\n<ul>\n<li><code>gray-matter</code>: To extract frontmatter metadata (title, date, summary).</li>\n<li><code>marked</code>: To convert Markdown body text into HTML.</li>\n</ul>\n</li>\n<li><strong>Output</strong>: The script generates a single <code>src/assets/blog-data.json</code> file containing all posts.</li>\n</ul>\n<h3>3. The Data Flow</h3>\n<ol>\n<li><strong>Write</strong>: Content is authored in Markdown.</li>\n<li><strong>Build</strong>:\n<ul>\n<li><code>npm start</code> or <code>npm run build</code> triggers the content generation script.</li>\n<li>The script compiles Markdown -&gt; JSON.</li>\n</ul>\n</li>\n<li><strong>Serve</strong>: The Angular dev server serves the app and the <code>assets/blog-data.json</code> file.</li>\n<li><strong>Consume</strong>: The Angular app loads the JSON file to display the blog list and individual articles.</li>\n</ol>\n<h2>Deployment</h2>\n<p>The entire environment is containerized using <strong>Docker</strong>.</p>\n<ul>\n<li>A custom <code>Dockerfile</code> installs Node.js and Angular CLI.</li>\n<li>It ensures consistency across development and deployment environments (no more &quot;it works on my machine&quot;!).</li>\n</ul>\n<h2>Why this stack?</h2>\n<p>This setup offers the best of both worlds:</p>\n<ul>\n<li><strong>Developer Experience</strong>: I use standard tools (Node.js, Angular) without needing to learn a specific SSG's template language.</li>\n<li><strong>Control</strong>: The content generation logic is just 50 lines of JavaScript, fully customizable.</li>\n<li><strong>Performance</strong>: The entire blog database is a tiny JSON file, loaded instantly.</li>\n</ul>\n<p>Feel free to explore the code on <a href=\"https://github.com/RuideFu/ruidefu.github.io\">GitHub</a>!</p>\n",
      "url": "/blog/project-architecture"
    }
  ]
}