{
  "data": [
    {
      "title": "Building a Modern Portfolio: Angular + Headless Hugo",
      "date": "2024-12-14T20:00:00.000Z",
      "draft": false,
      "summary": "A deep dive into the architecture of this website, featuring Angular 19, Headless Hugo, and a custom JSON API.",
      "slug": "project-architecture",
      "content": "<p>Welcome to my new portfolio site! This project represents a modern approach to static site generation, combining the component-based architecture of <strong>Angular</strong> with the blazing-fast content management of <strong>Hugo</strong>.</p>\n<h2>The Architecture</h2>\n<p>The core philosophy behind this project is <strong>separation of concerns</strong>. The frontend content delivery is decoupled from content management, allowing each text stack to do what it does best.</p>\n<h3>1. Angular Frontend</h3>\n<p>The user interface is built with <strong>Angular</strong>, utilizing the latest features like <strong>Signals</strong> and <strong>Standalone Components</strong>. </p>\n<ul>\n<li><strong>Navigation</strong>: Client-side routing with the Angular Router ensures instant page transitions.</li>\n<li><strong>Material Design</strong>: Angular Material provides a robust, accessible component library.</li>\n<li><strong>Data Fetching</strong>: The <code>BlogService</code> uses Angular&#39;s <code>HttpClient</code> to fetch content dynamically.</li>\n</ul>\n<h3>2. Headless Hugo</h3>\n<p>Instead of using Hugo to render full HTML pages, we configure it as a <strong>Headless CMS</strong>.</p>\n<ul>\n<li><strong>Content</strong>: All blog posts are written in Markdown.</li>\n<li><strong>Output</strong>: Custom layouts in <code>layouts/_default/</code> allow Hugo to output <strong>JSON</strong> instead of HTML.<ul>\n<li><code>index.json</code>: Returns a list of all posts with metadata.</li>\n<li><code>single.json</code>: Returns the full content of an individual post.</li>\n</ul>\n</li>\n</ul>\n<p>This allows us to treat the filesystem as a database.</p>\n<h3>3. The Data Flow</h3>\n<ol>\n<li><strong>Write</strong>: Content is authored in Markdown.</li>\n<li><strong>Build</strong>: Hugo compiles the content into JSON files in the <code>public/</code> directory.</li>\n<li><strong>Serve</strong>: The Angular dev server (or a production web server) serves these static JSON files.</li>\n<li><strong>Consume</strong>: The Angular app requests <code>index.json</code> to build the blog list and <code>posts/{slug}/index.json</code> to render the article.</li>\n</ol>\n<h2>Deployment</h2>\n<p>The entire environment is containerized using <strong>Docker</strong>.</p>\n<ul>\n<li>A custom <code>Dockerfile</code> installs Node.js, Angular CLI, and Hugo Extended.</li>\n<li>This ensures consistency across development and deployment environments (no more &quot;it works on my machine&quot;!).</li>\n</ul>\n<h2>Why this stack?</h2>\n<p>This setup offers the best of both worlds:</p>\n<ul>\n<li><strong>Developer Experience</strong>: I can use Angular&#39;s powerful tooling for UI development.</li>\n<li><strong>Content Management</strong>: writing in Markdown is simple, portable, and version-controllable.</li>\n<li><strong>Performance</strong>: The final result is a static site that can be hosted anywhere (GitHub Pages, Netlify, S3) with zero backend maintenance.</li>\n</ul>\n<p>Feel free to explore the code on <a href=\"https://github.com/RuideFu/temp-personal\">GitHub</a>!</p>\n",
      "url": "/blog/project-architecture"
    }
  ]
}